
## Plan Result (management/domains)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2810302415)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.root_domain.aws_route53_zone.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.root_domain.aws_route53_zone.this will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "tqer39.com"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/terraform/environments/management/domains"
        }
      + zone_id       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":124,"Program":"tfcmt","SHA1":"84f3eecd45893d8ff37b5c1a4ada1a7a1cadbc6e","Target":"management/domains","Vars":{},"WorkflowName":"Terraform - AWS - Management"} -->